raspberrypi/rp2040-expander/host/picoexp.c
static pexp_err_t set_gpio_input_enabled(uint32_t gpio, bool enable) {

    if (enable) {
        return pexp_hw_set_bits(_reg(padsbank0_hw->io[gpio]), PADS_BANK0_GPIO0_IE_BITS);
    } else {
        return pexp_hw_clear_bits(_reg(padsbank0_hw->io[gpio]), PADS_BANK0_GPIO0_IE_BITS);
    }
}

//----------------------------------------------------------------------------

// Public API

pexp_err_t pexp_init(void) {

    pexp_err_t pexp_err;

    pexp_err = dap_if_init();

    if (pexp_err == PEXP_OK) {
        pexp_err = chip_init();
    }

    return pexp_err;
}

//----------------------------------------------------------------------------

pexp_err_t pexp_gpio_block_enable(bool enable) {

    return peripheral_enable(enable, RESETS_RESET_PADS_BANK0_BITS | RESETS_RESET_IO_BANK0_BITS);
}


pexp_err_t pexp_gpio_init(uint32_t gpio) {

    uint32_t mask = 1ul << gpio;
    pexp_err_t pexp_err = pexp_hw_clear_bits(_reg(sio_hw->gpio_out), mask);

    // set as output
    if (pexp_err == PEXP_OK) {
        pexp_err = pexp_gpio_set_dir_out_masked(mask);
    }

    if (pexp_err == PEXP_OK) {
        pexp_err = set_gpio_function(gpio, GPIO_FUNC_SIO);
    }

    return pexp_err;
}


pexp_err_t pexp_gpio_init_mask(uint32_t mask) {

    pexp_err_t pexp_err = PEXP_OK;

    for (uint32_t bit = 0; bit < NUM_BANK0_GPIOS && pexp_err == PEXP_OK; bit++) {

        if (mask & (1ul << bit)) {
            pexp_err = pexp_gpio_init(bit);
        }
    }

    return pexp_err;
}


pexp_err_t pexp_gpio_deinit(uint32_t gpio) {
    return set_gpio_function(gpio, GPIO_FUNC_NULL);
}


pexp_err_t pexp_gpio_deinit_mask(uint32_t mask) {

    pexp_err_t pexp_err = PEXP_OK;

    for (uint32_t bit = 0; bit < NUM_BANK0_GPIOS && pexp_err == PEXP_OK; bit++) {

        if (mask & (1ul << bit)) {
            pexp_err = pexp_gpio_deinit(bit);
        }
    }

    return pexp_err;
}


pexp_err_t pexp_gpio_set_dir(uint32_t gpio, gpio_dir_t gpio_dir) {

    uint32_t mask = 1ul << gpio;

    if (gpio_dir == GPIO_DIR_IN) {
        return pexp_gpio_set_dir_in_masked(mask);
    } else {
        return pexp_gpio_set_dir_out_masked(mask);
    }
}


pexp_err_t pexp_gpio_set_dir_out_masked(uint32_t mask) {
    return pexp_write32(_reg(sio_hw->gpio_oe_set), mask);
}


pexp_err_t pexp_gpio_set_dir_in_masked(uint32_t mask) {
    return pexp_write32(_reg(sio_hw->gpio_oe_clr), mask);
}


pexp_err_t pexp_gpio_set_mask(uint32_t mask) {
    return pexp_write32(_reg(sio_hw->gpio_set), mask);
}


pexp_err_t pexp_gpio_clr_mask(uint32_t mask) {
    return pexp_write32(_reg(sio_hw->gpio_clr), mask);
}


pexp_err_t pexp_gpio_toggle_mask(uint32_t mask) {
    return pexp_write32(_reg(sio_hw->gpio_togl), mask);
}


pexp_err_t pexp_gpio_set(uint32_t gpio) {
    return pexp_gpio_set_mask(1ul << gpio);
}


pexp_err_t pexp_gpio_clr(uint32_t gpio) {
    return pexp_gpio_clr_mask(1ul << gpio);
}


pexp_err_t pexp_gpio_toggle(uint32_t gpio) {
    return pexp_gpio_toggle_mask(1ul << gpio);
}


uint32_t pexp_gpio_get_all(void) {

    uint32_t read_value;

    if (PEXP_OK != pexp_read32(_reg(sio_hw->gpio_in), &read_value)) {
        return 0xFFFFFFFFul;
    }

    return read_value;
}


pexp_err_t pexp_gpio_set_all(uint32_t mask) {
    return pexp_write32(_reg(sio_hw->gpio_out), mask);
}


pexp_err_t pexp_clock_gpio_init(uint32_t gpio, pexp_clkout_t clk_src, float div)
{
    uint32_t div_int = (uint32_t)div;
    uint8_t frac = (uint8_t)((div - (float)div_int) * (1u << CLOCKS_CLK_GPOUT0_DIV_INT_LSB));
    return _clock_gpio_init_int_frac(gpio, clk_src, div_int, frac);
}


// Simple clock init code, with some parameters to set up the PLL (etc.)
pexp_err_t pexp_set_rosc(void) {
    return PEXP_ERR_UNSUPPORTED;
}

pexp_err_t pexp_set_xosc(void) {
    return PEXP_ERR_UNSUPPORTED;
}

//----------------------------------------------------------------------------

pexp_err_t pexp_read32(uint32_t address, uint32_t *pdata) {

    if (!pdata) {
        return PEXP_ERR_API_ARG;
    }

    uint32_t dummy;
    pexp_err_t pexp_err = dap_set_target_rd_wr_address(address, NO_AUTO_INC);  // set address, inc mode

    if (pexp_err == PEXP_OK) {
        pexp_err = dap_read(AP_REG_IDR, &dummy);    // read dummy word
    }

    if (pexp_err == PEXP_OK) {
        pexp_err = dap_read(DP_REG_RDBUF, pdata);     // read actual data
    }

    return pexp_err;
}


pexp_err_t pexp_write32(uint32_t address, uint32_t data) {

    uint32_t dummy;
    pexp_err_t pexp_err = dap_set_target_rd_wr_address(address, NO_AUTO_INC);  // set address, inc mode

    if (pexp_err == PEXP_OK) {
        pexp_err = dap_write(AP_REG_IDR, data);     // write desired data
    }

    if (pexp_err == PEXP_OK) {
        pexp_err = dap_read(DP_REG_RDBUF, &dummy);    // dummy READ to flush the WRITE!!
    }

    return pexp_err;
}

//----------------------------------------------------------------------------

pexp_err_t pexp_block_read32(uint32_t address, uint32_t *pdata, uint32_t length) {

    if (!pdata) {
        return PEXP_ERR_API_ARG;
    }

    uint32_t dummy;
    pexp_err_t pexp_err = PEXP_OK;

    while (pexp_err == PEXP_OK && length) {
        uint32_t xfer_length;

        if (length > DAP_BLOCK_XFER_MAX_WORD_LENGTH) {
             xfer_length = DAP_BLOCK_XFER_MAX_WORD_LENGTH;
        } else {
            xfer_length = length;
        }

        pexp_err = dap_set_target_rd_wr_address(address, USE_AUTO_INC);

        address += (xfer_length * 4);
        length -= xfer_length;

        if (pexp_err == PEXP_OK) {
            pexp_err = dap_read(AP_REG_IDR, &dummy);    // read dummy word
        }

        while (pexp_err == PEXP_OK && xfer_length--) {
            pexp_err = dap_read(AP_REG_DRW, pdata++);     // read actual data
        }
    }

    return pexp_err;
}


pexp_err_t pexp_block_write32(uint32_t address, const uint32_t *pdata, uint32_t length) {

    if (!pdata) {
        return PEXP_ERR_API_ARG;
    }

    uint32_t dummy = 0;
    pexp_err_t pexp_err = PEXP_OK;

    while (pexp_err == PEXP_OK && length) {
        uint32_t xfer_length;

        if (length > DAP_BLOCK_XFER_MAX_WORD_LENGTH) {
             xfer_length = DAP_BLOCK_XFER_MAX_WORD_LENGTH;
        } else {
            xfer_length = length;
        }

        pexp_err = dap_set_target_rd_wr_address(address, USE_AUTO_INC);

        address += (xfer_length * 4);
        length -= xfer_length;

        while (pexp_err == PEXP_OK && xfer_length--) {
            pexp_err = dap_write(AP_REG_DRW, *pdata++);
        }

        if (pexp_err == PEXP_OK) {
            pexp_err = dap_read(DP_REG_RDBUF, &dummy);  // dummy READ to flush the WRITE!!
        }
    }

    return pexp_err;
}

//----------------------------------------------------------------------------

