raspberrypi/rp2040-expander/host/picoexp.c
// Note:  To 'speed things up' we could use inlining, remove some checking etc.
// but it won't make much difference.  The time consuming part is doing the DAP
// transactions which the use of these helpers reduces to a minimum already.

pexp_err_t pexp_write_hw_mask(uint32_t addr, uint32_t values, uint32_t write_mask) {

    if (addr < SYSINFO_BASE) {
        return PEXP_ERR_API_ARG;
    }

    uint32_t temp;
    pexp_err_t pexp_err = pexp_read32(addr, &temp);

    if (pexp_err == PEXP_OK) {
        temp &= ~write_mask;
        temp |= (write_mask & values);

        pexp_err = pexp_write32(addr, temp);
    }

    return pexp_err;
}


pexp_err_t pexp_hw_set_bits(uint32_t addr, uint32_t mask) {

    if (addr < SYSINFO_BASE) {
        return PEXP_ERR_API_ARG;
    }

    return pexp_write32(REG_ALIAS_SET_BITS | addr, mask);
}


pexp_err_t pexp_hw_clear_bits(uint32_t addr, uint32_t mask) {

    if (addr < SYSINFO_BASE) {
        return PEXP_ERR_API_ARG;
    }

    return pexp_write32(REG_ALIAS_CLR_BITS | addr, mask);
}


pexp_err_t pexp_hw_xor_bits(uint32_t addr, uint32_t mask) {

    if (addr < SYSINFO_BASE) {
        return PEXP_ERR_API_ARG;
    }

    return pexp_write32(REG_ALIAS_XOR_BITS | addr, mask);
}

//----------------------------------------------------------------------------

pexp_err_t pexp_gpio_hi_block_enable(bool enable) {

    return peripheral_enable(enable, RESETS_RESET_PADS_QSPI_BITS | RESETS_RESET_IO_QSPI_BITS);
}


pexp_err_t pexp_gpio_hi_init(uint32_t higpio) {

    if (higpio >= NUM_QSPI_GPIOS) {
        return PEXP_ERR_API_ARG;
    }

    uint32_t himask = 1ul << higpio;
    pexp_err_t pexp_err = pexp_hw_clear_bits(_reg(sio_hw->gpio_hi_out), himask);

    // set as output
    if (pexp_err == PEXP_OK) {
        pexp_err =  pexp_gpio_hi_set_dir_out_masked(himask);
    }

    if (pexp_err == PEXP_OK) {
        pexp_err = set_gpio_hi_function(higpio, GPIO_FUNC_SIO);
    }

    return pexp_err;
}


pexp_err_t pexp_gpio_hi_init_mask(uint32_t himask) {

    pexp_err_t pexp_err = PEXP_OK;

    for (uint32_t bit = 0; bit < NUM_BANK0_GPIOS && pexp_err == PEXP_OK; bit++) {

        if (himask & (1ul << bit)) {
            pexp_err =  pexp_gpio_hi_init(bit);
        }
    }

    return pexp_err;
}


pexp_err_t pexp_gpio_hi_deinit(uint32_t higpio) {

    return set_gpio_hi_function(higpio, GPIO_FUNC_NULL);
}


pexp_err_t pexp_gpio_hi_deinit_mask(uint32_t higpio_mask) {

    pexp_err_t pexp_err = PEXP_OK;

    for (uint32_t bit = 0; bit < NUM_QSPI_GPIOS && pexp_err == PEXP_OK; bit++) {

        if (higpio_mask & (1ul << bit)) {
            pexp_err =  pexp_gpio_hi_deinit(bit);
        }
    }

    return pexp_err;
}


pexp_err_t pexp_gpio_hi_set_dir(uint32_t higpio, gpio_dir_t gpio_dir) {

    if (higpio >= NUM_QSPI_GPIOS) {
        return PEXP_ERR_API_ARG;
    }

    uint32_t himask = 1ul << higpio;

    if (gpio_dir == GPIO_DIR_IN) {
        return  pexp_gpio_hi_set_dir_in_masked(himask);
    } else {
        return  pexp_gpio_hi_set_dir_out_masked(himask);
    }
}


pexp_err_t pexp_gpio_hi_set_dir_out_masked(uint32_t himask) {
    return pexp_write32(_reg(sio_hw->gpio_hi_oe_set), himask);
}


pexp_err_t pexp_gpio_hi_set_dir_in_masked(uint32_t himask) {
    return pexp_write32(_reg(sio_hw->gpio_hi_oe_clr), himask);
}


pexp_err_t pexp_gpio_hi_set_mask(uint32_t himask) {
    return pexp_write32(_reg(sio_hw->gpio_hi_set), himask);
}


pexp_err_t pexp_gpio_hi_clr_mask(uint32_t himask) {
    return pexp_write32(_reg(sio_hw->gpio_hi_clr), himask);
}


pexp_err_t pexp_gpio_hi_toggle_mask(uint32_t himask) {
    return pexp_write32(_reg(sio_hw->gpio_hi_togl), himask);
}


uint32_t pexp_gpio_hi_get_all(void) {

    uint32_t hiread_value;

    if (PEXP_OK != pexp_read32(_reg(sio_hw->gpio_hi_in), &hiread_value)) {
        return 0xFFFFFFFFul;
    }

    return hiread_value;
}


pexp_err_t pexp_gpio_hi_set_all(uint32_t himask) {
    return pexp_write32(_reg(sio_hw->gpio_hi_out), himask);
}


pexp_err_t pexp_gpio_set_pulls(uint32_t gpio, bool up, bool down) {

    return pexp_write_hw_mask(_reg(padsbank0_hw->io[gpio]),
        (bool_to_bit(up) << PADS_BANK0_GPIO0_PUE_LSB) | (bool_to_bit(down) << PADS_BANK0_GPIO0_PDE_LSB),
        PADS_BANK0_GPIO0_PUE_BITS | PADS_BANK0_GPIO0_PDE_BITS);
}

//----------------------------------------------------------------------------


pexp_err_t pexp_adc_block_enable(bool enable) {

    pexp_err_t pexp_err = adc_clock_init(enable);

    if (pexp_err == PEXP_OK) {
        pexp_err = peripheral_enable(enable, RESETS_RESET_ADC_BITS);
    }

    return pexp_err;
}


pexp_err_t pexp_adc_init(void) {

    pexp_err_t pexp_err = pexp_adc_block_enable(false);

    if (pexp_err == PEXP_OK) {
        pexp_err = pexp_adc_block_enable(true);
    }

    if (pexp_err == PEXP_OK) {
        pexp_err = pexp_write32(_reg(adc_hw->cs),  ADC_CS_EN_BITS);
    }

    for (uint32_t escape = 0; pexp_err == PEXP_OK; escape++) {

        uint32_t adc_hw_cs;

        pexp_err = pexp_read32(_reg(adc_hw->cs), &adc_hw_cs);

        if (pexp_err == PEXP_OK && (adc_hw_cs & ADC_CS_READY_BITS)) {
            break;
        }

        if (escape > ADC_ESCAPE_COUNT) {
           pexp_err = PEXP_ERR_ADC_TIMEOUT;
        }
    }

    return pexp_err;
}


pexp_err_t pexp_adc_gpio_init(uint32_t gpio) {

    if ((gpio >= NUM_BANK0_GPIOS) ||
        (gpio <= (NUM_BANK0_GPIOS - NUM_ADC_CHANNELS))) {
        return PEXP_ERR_API_ARG;
    }

    // Select NULL function to make output driver hi-Z
    pexp_err_t pexp_err = set_gpio_function(gpio, GPIO_FUNC_NULL);

    // Disable digital pulls and digital receiver
    if (pexp_err == PEXP_OK) {
        pexp_err = pexp_disable_gpio_pulls(gpio);
    }

    if (pexp_err == PEXP_OK) {
        pexp_err = set_gpio_input_enabled(gpio, 0);
    }

    return pexp_err;
}


pexp_err_t pexp_adc_select_input(uint32_t input) {

    if (input >= NUM_ADC_CHANNELS) {
        return PEXP_ERR_API_ARG;
    }

    return pexp_write_hw_mask(_reg(adc_hw->cs), input << ADC_CS_AINSEL_LSB, ADC_CS_AINSEL_BITS);
}


pexp_err_t pexp_adc_get_selected_input(uint32_t *pinput) {

