raspberrypi/rp2040-expander/host/picoexp.c
    if (!pinput) {
        return PEXP_ERR_API_ARG;
    }

    pexp_err_t pexp_err = pexp_read32(_reg(adc_hw->cs), pinput);

    *pinput  &= ADC_CS_AINSEL_BITS;
    *pinput >>= ADC_CS_AINSEL_LSB;

    if (pexp_err != PEXP_OK) {
        *pinput = 0;
    }

    return pexp_err;
}


pexp_err_t pexp_adc_set_temp_sensor_enabled(bool enable) {

    if (enable) {
        return pexp_hw_set_bits(_reg(adc_hw->cs), ADC_CS_TS_EN_BITS);
    } else {
        return pexp_hw_clear_bits(_reg(adc_hw->cs), ADC_CS_TS_EN_BITS);
    }
}


pexp_err_t pexp_adc_read(uint16_t *padc) {

    uint32_t escape;
    uint32_t adc_rd_regs;
    pexp_err_t pexp_err = pexp_hw_set_bits(_reg(adc_hw->cs), ADC_CS_START_ONCE_BITS);

    for (escape = 0; escape <= ADC_ESCAPE_COUNT && pexp_err == PEXP_OK; escape++) {

        pexp_err = pexp_read32(_reg(adc_hw->cs), &adc_rd_regs);

        if (pexp_err == PEXP_OK && (adc_rd_regs & ADC_CS_READY_BITS)) {

            pexp_err = pexp_read32(_reg(adc_hw->result), &adc_rd_regs);

            if (pexp_err == PEXP_OK) {
                *padc = (uint16_t) (adc_rd_regs  & 0x0000FFFFul);
            }
            break;
        }
    }

    if (escape > ADC_ESCAPE_COUNT) {
        pexp_err = PEXP_ERR_ADC_TIMEOUT;
    }

    if (pexp_err != PEXP_OK) {
        *padc = 0;
    }

    return pexp_err;
}


pexp_err_t pexp_time_get_ticks32(uint32_t *pticks) {

    if (!pticks) {
        return PEXP_ERR_API_ARG;
    }

    return pexp_read32(_reg(timer_hw->timerawl), pticks);
}


pexp_err_t pexp_time_get_ticks64(uint64_t *pticks) {

    if (!pticks) {
        return PEXP_ERR_API_ARG;
    }

    uint32_t lo, hi;

    // Reading low latches the high value
    pexp_err_t pexp_err = pexp_read32(_reg(timer_hw->timelr), &lo);

    if (pexp_err == PEXP_OK) {
        pexp_err = pexp_read32(_reg(timer_hw->timehr), &hi);
    }

    if (pexp_err == PEXP_OK) {
        *pticks = ((uint64_t) hi << 32u) | lo;
    }

    return pexp_err;
}


pexp_err_t pexp_rosc_set_div(uint32_t rosc_div) {

    if (rosc_div == 0 || rosc_div > 32) {
        return PEXP_ERR_API_ARG;
    }

    if (rosc_div == 32) {
        rosc_div = 0;
    }

    return pexp_write32(_reg(rosc_hw->div), (rosc_div + ROSC_DIV_VALUE_PASS));
}


pexp_err_t pexp_rosc_get_div(uint32_t *pdiv) {

    pexp_err_t pexp_err = pexp_read32(_reg(rosc_hw->div), pdiv);

    if (pexp_err == PEXP_OK) {

        *pdiv -= ROSC_DIV_VALUE_PASS;
        if (*pdiv == 0) {
            *pdiv = 32;
        }
    }
    else {
        *pdiv = 0;
    }

    return pexp_err;
}


pexp_err_t pexp_rosc_get_freq_ab_bits(uint32_t *pfreq) {

    uint32_t freqa, freqb;

    pexp_err_t pexp_err = pexp_read32(_reg(rosc_hw->freqa), &freqa);

    if (pexp_err == PEXP_OK) {
        pexp_err = pexp_read32(_reg(rosc_hw->freqb), &freqb);
    }

    if (pexp_err == PEXP_OK) {
        *pfreq = ((freqb << 16)  | (freqa & 0xfffful));
    }

    return pexp_err;
}


pexp_err_t pexp_rosc_set_freq_ab_bits(uint32_t freq32) {

    pexp_err_t pexp_err = pexp_write32(_reg(rosc_hw->freqa), (ROSC_FREQA_PASSWD_VALUE_PASS << ROSC_FREQA_PASSWD_LSB) | (freq32 & 0xfffful));

    if (pexp_err == PEXP_OK) {
        pexp_err = pexp_write32(_reg(rosc_hw->freqb), (ROSC_FREQB_PASSWD_VALUE_PASS << ROSC_FREQB_PASSWD_LSB) | (freq32 >> 16ul));
    }

    return PEXP_OK;
}


uint32_t pexp_rosc_inc_freq_ab_bits(uint32_t freq32) {

    // Note:  We set bits working *down* from the MS side since, with shorter
    // ROSC chain lengths (MEDIUM, HIGH) the LS sections are the ones removed.
    for (unsigned int bit = 30; bit >= 0; bit--) {

        if ((bit % 4) == 3) {
            continue;  // there are no active bits at positions 3, 7, 11 ... 31
        }

        uint32_t bit_mask = 1ul << bit;

        if (freq32 & bit_mask) {
            continue; // already set
        }

        freq32 |= bit_mask;  // set it!!
        break;
    }

    return freq32;
}


uint32_t pexp_rosc_dec_freq_ab_bits(uint32_t freq32) {

    // Work up, LS->MS, see comment in: pexp_rosc_inc_freq_ab_bits()
    for (unsigned int bit = 0; bit < 31; bit++) {

        if ((bit % 4) == 3) {
            continue;  // there are no active bits at positions 3, 7, 11 ... 31
        }

        uint32_t bit_mask = 1ul << bit;

        if (0 == (freq32 & bit_mask)) {
            continue; // already clear
        }

        freq32 &= ~bit_mask;  // clear it!!
        break;
    }

    return freq32;
}


pexp_err_t pexp_rosc_measure_postdiv_clock_freq(uint32_t *rosc_freq_hz, uint32_t min_sample_us) {

    pexp_err_t pexp_err;
    uint64_t delta_time_us;
    rosc_time_n_count_t current_rosc_time_n_count;

    *rosc_freq_hz = 0;

    do {
        pexp_err = get_timespec_and_tickcount(&current_rosc_time_n_count);

        if (pexp_err != PEXP_OK) {
            break;
        }

        delta_time_us = current_rosc_time_n_count.time_us - snapshot_rosc_time_n_count.time_us;

        if (delta_time_us > (uint64_t) min_sample_us) {
            break;
        }

    } while (min_sample_us);

    if (pexp_err == PEXP_OK) {

        uint64_t delta_tick_count = current_rosc_time_n_count.tick_count - snapshot_rosc_time_n_count.tick_count;
        *rosc_freq_hz = (uint32_t) ((delta_tick_count * (uint64_t) 1000000ull * (uint64_t) TICK_GENERATOR_CYCLES) / delta_time_us);

        // update the static datapoint for any subsequent calculation(s)
        snapshot_rosc_time_n_count = current_rosc_time_n_count;
    }

    return pexp_err;
}


static pexp_err_t rosc_trim(uint32_t target_rosc_postdiv_clock_hz,  uint32_t *measured_rosc_postdiv_clock_hz) {

    pexp_err_t pexp_err = PEXP_OK;
    uint32_t freq_bits, last_bits_setting;
    uint32_t freq_delta;
    uint32_t last_delta = (uint32_t) -1; // set improbably bad "last" delta

    freq_bits = 0;

    do {
        pexp_err = pexp_rosc_set_freq_ab_bits(freq_bits);

        if (pexp_err == PEXP_OK) {
            last_bits_setting = freq_bits;
            pexp_err = pexp_rosc_measure_postdiv_clock_freq(measured_rosc_postdiv_clock_hz, MIN_ROSC_FREQ_SAMPLE_TIME_US);
        }

        if (pexp_err == PEXP_OK) {
            if (*measured_rosc_postdiv_clock_hz > target_rosc_postdiv_clock_hz) {
                freq_delta = *measured_rosc_postdiv_clock_hz - target_rosc_postdiv_clock_hz;
            } else {
                freq_delta = target_rosc_postdiv_clock_hz - *measured_rosc_postdiv_clock_hz;
            }

            if (freq_delta >= last_delta) {
                break;
            }

