raspberrypi/rp2040-expander/host/picoexp.c
            last_delta = freq_delta;

            freq_bits = pexp_rosc_inc_freq_ab_bits(freq_bits);
        }

    } while(1);

    if (pexp_err == PEXP_OK) {
        pexp_err = pexp_rosc_set_freq_ab_bits(last_bits_setting);
    }

    if (pexp_err == PEXP_OK) {
        pexp_err = pexp_rosc_measure_postdiv_clock_freq(measured_rosc_postdiv_clock_hz, MIN_ROSC_FREQ_SAMPLE_TIME_US);
    }

    return pexp_err;
}


pexp_err_t pexp_rosc_set_faster_postdiv_clock_freq(uint32_t target_rosc_postdiv_clock_hz, uint32_t *measured_rosc_postdiv_clock_hz) {

    uint32_t freq_bits;
    uint32_t rosc_div;

    uint32_t rosc_freq_hz;
    uint32_t new_rosc_freq_hz;

    pexp_err_t pexp_err = pexp_rosc_get_freq_ab_bits(&freq_bits);

    if (pexp_err == PEXP_OK && freq_bits) {
        // Firstly, if ROSC has been trimmed _up_ at all - trim it fully down
        pexp_err = pexp_rosc_set_freq_ab_bits(0);
    }

    if (pexp_err == PEXP_OK) {
        pexp_err = pexp_rosc_measure_postdiv_clock_freq(measured_rosc_postdiv_clock_hz, MIN_ROSC_FREQ_SAMPLE_TIME_US);
    }

    if (pexp_err == PEXP_OK && (target_rosc_postdiv_clock_hz < *measured_rosc_postdiv_clock_hz)) {
        // it is not possible to slow things down further because the diver setting
        // can not be increased without [possibly] glitching the ROSC clock.
        // Return "OK" and leave the *caller* to decide if this is slow enough ...
        return PEXP_OK;
    }

    if (pexp_err == PEXP_OK) {
        pexp_err = pexp_rosc_get_div(&rosc_div);
    }

    if (pexp_err == PEXP_OK) {

        uint32_t new_div;

        for (new_div = rosc_div; new_div > 1; new_div--) {

            new_rosc_freq_hz = target_rosc_postdiv_clock_hz * new_div;

            // this could be smarter for low target freqs (~10 MHz) but will [still]
            // work optimally for higher target frquencies (such as 48 MHz).
            if (new_rosc_freq_hz <= ROSC_MAX_FREQ) {
                break;
            }
        }

        pexp_err = pexp_rosc_set_div(new_div);
    }

    if (pexp_err == PEXP_OK) {
        pexp_err = rosc_trim(target_rosc_postdiv_clock_hz, measured_rosc_postdiv_clock_hz);
    }

    return pexp_err;
}
